app/controllers/api/events_controller.rb

INSERT INTO "events" ("time", "num_slots", "address", "description", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.register_user(current_user)

    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 3]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy!