app/controllers/api/forums_controller.rb

  def create
    @forum = Forum.new(forum_params)
    @forum.author_id = current_user.id

    if @forum.save
---
INSERT INTO "forums" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Tring again"], ["author_id", 1], ["created_at", "2015-08-11 22:24:34.277202"], ["updated_at", "2015-08-11 22:24:34.277202"]]

  def index
    @forums = Forum.all
---
SELECT "forums".* FROM "forums"

  def show
    @forum = Forum.find(params[:id])
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT 1  [["id", 1]]