app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("forum_id", "title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["forum_id", 1], ["title", "One More"], ["body", "Here we go"], ["author_id", 1], ["created_at", "2015-08-11 22:41:34.515291"], ["updated_at", "2015-08-11 22:41:34.515291"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save