app/controllers/api/signups_controller.rb

INSERT INTO "signups" ("event_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 3], ["attendee_id", 2], ["created_at", "2015-08-12 21:47:01.228925"], ["updated_at", "2015-08-12 21:47:01.228925"]]
---
  def create
    @signup = Signup.new(params[:event_id])
    @signup.register_user

    if @signup.save

SELECT  "signups".* FROM "signups" WHERE "signups"."id" = $1 LIMIT 1  [["id", 21]]
DELETE FROM "signups" WHERE "signups"."id" = $1  [["id", 21]]
---
  def destroy
    @signup = Signup.find(params[:id])
    @signup.destroy!